{
    "form": {
        "plan": "Plánování trasy",
        "start": "Počátek",
        "end": "Cíl",
        "departureDate": "Datum odjezdu",
        "departureTime": "Čas odjezdu",
        "show": "Ukázat trasy",
        "switch": "Prohodit počátek a cíl",
        "showPreferences": "Zobrazit rozšířená nastavení",
        "validation": {
            "invalidDate": "Neplatné datum",
            "invalidTime": "Neplatný čas"
        }
    },
    "feedback": {
        "error": "Nepodařilo se načíst trasy",
        "noTripsFound": "Nebyla nalezena žádná vhodná trasa"
    },
    "preferences": {
        "headline": "Rozšířená nastavení",
        "transferPoints": "Přestupní body",
        "noParkingLots": "Žádná parkoviště v blízkosti",
        "transport": "Preferované dopravní prostředky",
        "bestTrip": "Nalézt nejlepší trasu (může trvat dlouho)",
        "pickup": "Místo vyzvednutí",
        "return": "Budu se vracet",
        "returnDate": "Datum návratu",
        "returnTime": "Čas návratu"
    },
    "transfer": {
        "select": "Zvolit jako přestupní bod",
        "deselect": "Zrušit výběr přestupního bodu",
        "transferPlural": "přestupů",
        "transferSingular": "přestup",
        "transfer234": "přestupy"
    },
    "language": {
        "select": "Jazyk",
        "cs": "🇨🇿",
        "en": "🇬🇧"
    },
    "transport": {
        "bus": "Autobus",
        "rail": "Vlak",
        "tram": "Tramvaj",
        "trolleybus": "Trolejbus",
        "metro": "Metro"
    },
    "outbound": "Cesty tam",
    "return": "Cesty zpět",
    "date": "Datum",
    "delay": "Zpoždění",
    "via": "přes",
    "eco": "Nejekologičtější",
    "fastest": "Nejkratší čas cesty",
    "sort": {
        "default": "Výchozí řazení",
        "asc": "Seřadit vzestupně",
        "desc": "Seřadit sestupně"
    },
    "about": {
        "title": "O aplikaci CarPub",
        "basicInfoTitle": "Základní informace",
        "usageTitle": "Jak používat tuto aplikaci",
        "contactTitle": "Kontakt",
        "basicInfo": "Aplikace CarPub vznikla jako diplomová práce na Fakultě informačních technologií VUT v Brně pod vedením Ing. Jiřího Hynka, Ph.D. Jedná se o multimodální dopravní plánovač, který umožňuje vytvářet trasy, které kombinují automobilovou a hromadnou dopravu. Tato aplikace je vhodná například pro lidi, kteří dojíždí do práce, případně pro turisty. Pro výpočet tras je použita open source aplikace OpenTripPlanner 2. Data o zpožděních a cesty pro jednotlivé spoje jsou získávány z aplikace Lissy.",
        "usage": {
            "formHeader": "Formulář pro zadání trasy",
            "formText": "Vlevo na obrazovce se nachází formulář, v němž se vyplní minimální informace důležité pro získání tras. Formulář obsahuje následující položky:",
            "formText2": "Pro výpočet tras poté stačí kliknout na tlačítko Ukázat trasy.",
            "form": {
                "startEnd": "Počáteční a koncový bod",
                "startEndText": "lze vybrat kliknutím do příslušného pole a posléze vybráním bodu z mapy (pomocí ikony mezi vstupy je lze prohodit).",
                "dateTime": "Datum a čas",
                "dateTimeText": "lze vybrat klikem do příslušného vstupu a výběrem příslušné hodnoty."
            },
            "preferencesHeader": "Rozšířená nastavení",
            "preferencesText": "Kromě zadání základních požadavků na trasu lze tyto požadavky ještě upravit po kliknutí na ikonu nalevo od nadpisu formuláře. V nastavení se dají nastavit následující položky:",
            "preferences": {
                "transferPointSelection": "Výběr přestupního bodu",
                "transferPointSelectionText": "volba přestupního bodu, který bude sloužit k přechodu mezi autem a hromadnou dopravou.",
                "pickup": "Místo vyzvednutí",
                "pickupText": "volba místa sloužící k převozu autem do cílové destinace (volba místa je stejná jako u zadání počátečního a koncového bodu ve formuláři).",
                "meansOfTransport": "Preferované dopravní prostředky",
                "meansOfTransportText": "možnost zvolit, které dopravní prostředky budou použity při dopravě z přestupního bodu do cíle.",
                "findBest": "Nalézt nejlepší trasu",
                "findBestText": "tato položka způsobí, že se pro vyhledání nejlepší trasy vyzkouší všechny vhodné přestupní body. Výpočet však může trvat delší dobu v závislosti na délce trasy.",
                "comingBack": "Budu se vracet",
                "comingBackText": "po kliknutí na tuto možnost lze nastavit datum a čas odjezdu zpět. Poté se kromě tras ze startu do cíle zobrazí i trasy z cíle do startu."
            },
            "transferStopsHeader": "Přestupní body",
            "transferStopsText": "Přestupní body jsou rovněž zobrazeny na mapě v podobě zelených kroužků. Po kliknutí na jakýkoliv z nich se zobrazí jeho název a možnost zvolit tento bod, který se použije pro danou trasu.",
            "tripShowHeader": "Zobrazení tras",
            "tripShowText": "Pokud se podaří nalézt trasy, které vyhovují požadavkům, zobrazí se jejich seznam v levé části obrazovky dole. Lze přepínat mezi trasami tam a trasami zpět. Zároveň se napravo od těchto možností nacházejí tlačítka umožňující řadit trasy podle rychlosti, nebo podle spotřeby (v danou chvíli lze řadit pouze podle jednoho parametru). Po kliknutí na jednu z tras se zobrazí detaily o ní. Součástí každého spoje na trase mohou být informace o zpoždění, které se nachází v pravém horním rohu každého spoje. Po kliknutí na tento údaj lze v tabulce vidět, jak se zpoždění vyvíjelo v pár dnech před datem odjezdu."
        },
        "contact": {
            "contactTitle": "Kontakt",
            "author": "Autor"
        }
    }
}